# Pivot Tables
Pivot table is a similar operation that is commonly seen in spreadsheets and other programs that operate on tabular data.

It takes simple columnwise data as input, and groups the entries into a two-dimensional table that provides a multi-dimensional summarization of the data.

It helps to think of **pivot table as essentially a multi-dimensional version of GroupBy aggregation.**

In [12]:
# Pivot Table Full Syntax

DataFrame.pivot_table(data, values=None, index=None, columns=None,
aggfunc='mean', fill_value=None, margins=False,
dropna=True, margins_name='All')

NameError: name 'DataFrame' is not defined

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 1. Pivot Table by hand

In [5]:
# let's scan the data
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [7]:
# we might proceed using something like this :
# 1) group by class and gender, select survival
# 2) apply a mean aggregate, combine the resulting groups
# 3) unstack the hierarchical index to reveal the hidden multi dimensionality

titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [8]:
# equivalent to above code
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### 2. Multi-level Pivot Table
Just as in the GroupBy, pivot tables can be specified with multiple levels.

In [10]:
# age as a third dimension
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [11]:
# add fare paid to the column
fare = pd.qcut(titanic['fare'], 2) #automatic quantile computation
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

### 3. Other

In [13]:
# Dictionary mapping for function specification.
titanic.pivot_table(index='sex', columns='class', aggfunc= {'survived' : sum, 'fare' : 'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [14]:
# Compute totals along each grouping
titanic.pivot_table('survived', index='sex', columns='class', margins=True) # margins = True for totals

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

<br><br>
# Handling Missing Data

1. Trade-offs in Missing data conventions
    <br>1) using a `mask` that glbally indicates missing values
    <br>2) or choosing a `sentinel` value that indicates a missing entry<br>
2. Missing Data in Pandas
    <br>1) None : Pythonic missing data.
    <br> because None is a Python object, it cannot be used in any arbrtrary NumPy / Pandas array.
    <br>2) NaN : Special floating-point value recognized by all systems.

In [3]:
import numpy as np
import pandas as pd

# Some special NaN operations
a = [1, 2, np.nan]
print(sum(a))       # return nan
print(np.nansum(a)) # return value after operating w/o nan
print(np.nanmin(a))
print(np.nanmax(a))

nan
3.0
1.0
2.0

3) Null : To facilitate this convention, there are several useful methods for detecting, removing, and replacing null values in Pandas

In [4]:
b = pd.DataFrame( {'b' : [1, 2, None ]})
print(b)
print(b.isnull())
print(b.notnull())
print(b.dropna())
print(b.fillna(0))
print(b.fillna(method='ffill')) #forward fill
print(b.fillna(method='bfill')) #backward fill

     b
0  1.0
1  2.0
2  NaN
       b
0  False
1  False
2   True
       b
0   True
1   True
2  False
     b
0  1.0
1  2.0
     b
0  1.0
1  2.0
2  0.0
     b
0  1.0
1  2.0
2  2.0
     b
0  1.0
1  2.0
2  NaN